In [1]:
import pandas as pd

In [5]:
# 크롤링해 온 자전거 대여소 정보를 확인한다.
stations = pd.read_csv("data/seoul_bike_station.csv")
stations.shape

(1531, 6)

In [6]:
stations[stations["대여소"].str.contains('홍대입구')]

     대여소번호           대여소   상태                        주소         위도          경도
93   113.0  홍대입구역 2번출구 앞  운영중   서울특별시 마포구 양화로 165 156-8  37.557499  126.923805
101  114.0  홍대입구역 8번출구 앞  운영중  서울특별시 마포구 양화로18길 3 192-5  37.557060  126.924423

In [9]:
stations[stations["대여소"].str.contains('하늘채코오롱')]

,대여소번호,대여소,상태,주소,위도,경도
561,183.0,하늘채코오롱아파트 건너편,운영중,서울특별시 마포구 연남로 30 하늘채코오롱아파트 건너편,37.565166,126.919395

In [11]:
# 크롤링해 온 정보와 전처리한 정보가 맞는지 확인한다.
station_no_name = pd.read_csv("data/bike-station-no-name.csv")
station_no_name.shape

(1548, 2)

In [12]:
station_no_name[station_no_name["대여소명"].str.contains('하늘채코오롱')]

    대여소번호           대여소명
81    183  하늘채코오롱아파트 건너편

In [17]:
df_2017 = pd.read_csv("data/seoul-bike-2017-reduce.csv", low_memory=False)
df_2017.shape

(4975954, 7)

In [18]:
df_2018 = pd.read_csv("data/seoul-bike-2018-reduce.csv", low_memory=False)
df_2018.shape

(9988088, 7)

In [19]:
df_2019 = pd.read_csv("data/seoul-bike-2019-reduce.csv", low_memory=False)
df_2019.shape

(5471294, 7)

In [23]:
# 대여소 번호가 int, object 타입으로 섞여 있다.
def get_station(df, station_no):
    return df[(df["대여대여소번호"].isin([station_no, str(station_no)])) ]

In [24]:
station_no = 183

In [25]:
df_2017_207 = get_station(df_2017, station_no)
df_2017_207.shape

(18262, 7)

In [26]:
df_2018_207 = get_station(df_2018, station_no)
df_2018_207.shape

(25271, 7)

In [27]:
df_2019_207 = get_station(df_2019, station_no)
df_2019_207.shape

(10657, 7)

In [28]:
df_207 = pd.concat([df_2017_207, df_2018_207, df_2019_207])

In [29]:
df_207.head()

,자전거번호SPB,대여일시,대여대여소번호,반납일시,반납대여소번호,이용시간(분),이용거리(M)
343,3042,2017-01-01 7:24,183,2017-01-01 8:19,700,54,6030.0
344,4006,2017-01-01 7:25,183,2017-01-01 8:18,700,53,6150.0
366,3329,2017-01-01 7:53,183,2017-01-01 7:59,113,5,1240.0
489,3524,2017-01-01 10:19,183,2017-01-01 10:23,113,4,1080.0
937,4901,2017-01-01 14:26,183,2017-01-01 14:33,113,6,1080.0

In [30]:
df_207.tail()

,자전거번호SPB,대여일시,대여대여소번호,반납일시,반납대여소번호,이용시간(분),이용거리(M)
5471044,17978,2019-05-31 23:12:19,183,2019-06-01 00:48:07,183,95,12380.0
5471046,4581,2019-05-31 23:09:59,183,2019-06-01 00:48:17,183,97,12430.0
5471100,23559,2019-05-31 23:57:57,183,2019-06-01 00:57:11,113,54,7470.0
5471101,7718,2019-05-31 23:59:31,183,2019-06-01 00:57:15,113,56,6440.0
5471286,5379,2019-05-31 22:25:49,183,2019-06-01 03:58:09,183,331,39340.0

In [31]:
df_207.to_csv("data/bike-station-183.csv", index=False)

In [32]:
pd.read_csv("data/bike-station-183.csv").head()

,자전거번호SPB,대여일시,대여대여소번호,반납일시,반납대여소번호,이용시간(분),이용거리(M)
0,3042,2017-01-01 7:24,183,2017-01-01 8:19,700,54,6030.0
1,4006,2017-01-01 7:25,183,2017-01-01 8:18,700,53,6150.0
2,3329,2017-01-01 7:53,183,2017-01-01 7:59,113,5,1240.0
3,3524,2017-01-01 10:19,183,2017-01-01 10:23,113,4,1080.0
4,4901,2017-01-01 14:26,183,2017-01-01 14:33,113,6,1080.0

In [ ]:
# (122745, 7)
pd.read_csv("data/bike-station-207.csv").shape